Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: །དེ་ནས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པོ་འདི་དག་མིང་ཙམ་ཞིག་བརྗོད་དེ་ཅང་མི་ཟེར་བར་འདུག་ནས། དེ་ལས་རབ་ཏུ་ཕྱེ་སྟེ་མ་བཤད་པ་དང་། དེ་ནས་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པོ་དེ་དག་གི་མིང་ཙམ་ཞིག་ཐོས་ལས་རབ་ཏུ་ཕྱེ་སྟེ།
en: Thus the bodhisattva Vajra­garbha spoke merely the names of these ten bodhisattva bhūmis, became silent, and did not elucidate any further. All the bodhisattvas of the assembly heard just the names of the ten bodhisattva bhūmis with no further elucidation or description.

source: མི་བརྗོད་པས་སྐོམ་པར་གྱུར་ནས་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པོ་དེ་དག་གི་མིང་ཙམ་ཞིག་བརྗོད་དེ་ཅང་མི་ཟེར་བར་འདུག་ནས།
en: Therefore, they yearned for that, thinking, “The bodhisattva Vajra­garbha thus spoke just the names of the ten bodhisattva bhūmis and said no more.

source: དེ་ལས་རབ་ཏུ་ཕྱེ་ཞིང་མི་སྟོན་པ་དེ་ལ་རྒྱུ་ནི་གང་རྐྱེན་ནི་ཅི་ཞིག་ཡོད་སྙམ་པ་དང་། དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་འདུས་པ་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་གྲོལ་བའི་ཟླ་བ་ཞེས་བྱ་བ་འདུས་ཤིང་འདུག་འདུག་སྟེ།
en: What is the cause and condition for his not giving any further elucidation?” At that time, the bodhisattva mahāsattva Vimukti­candra was present in that gathered assembly of bodhisattvas.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གྲོལ་བའི་ཟླ་བས། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེ་དག་གི་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་སེམས་ཀྱིས་ཡོངས་སུ་ཤེས་ནས། བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོ་ལ་ཀླུའི་དབྱངས་ཀྱིས་ཚིགས་སུ་བཅད་དེ་དོན་དེ་དྲིས་སོ།
en: The bodhisattva Vimukti­candra, knowing what was being thought in the minds of the assembly of bodhisattvas, addressed these questions in verse to the bodhisattva Vajra­garbha: “Why did you, lord, endowed with the qualities

source: །ཅི་ཕྱིར་རྟོག་པ་རྣམ་དག་ཅིང་། །དྲན་དང་ཡེ་ཤེས་ལྡན་པ་ཡིས།
en: Of pure thoughts, mindfulness, and wisdom,

source: །ས་ཡི་མཆོག་ནི་བརྗོད་བྱས་ཏེ།
en: Mention the supreme bhūmis

source: །མཁས་པས་རྣམ་པར་ཕྱེ་མི་བཤད།
en: But not explain them?

source: །འདི་ཀུན་ངེས་པར་རྟོགས་པ་སྟེ།
en: “All those here are certainly

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲགས་ཆེན་ཡིན།
en: Bodhisattvas of great renown.

source: །ཅི་ཕྱིར་ཁྱོད་ཀྱིས་བརྗོད་དེ།
en: Why did you speak of the bhūmis

source: །རབ་ཏུ་ཕྱེ་བ་བཤད་མི་བགྱི།
en: But not teach their details?

source: །རྒྱལ་སྲས་འཇིགས་མེད་འདི་དག་ནི།
en: “All these fearless

source: །ཀུན་ཀྱང་ཤིན་ཏུ་ཉན་པར་འདོད།
en: Bodhisattvas wish to listen.

source: །ས་ཡི་དོན་ཚུལ་ཡང་དག་ཏུ།
en: Describe perfectly the meaning

source: །རྣམ་པར་ཕྱེ་སྟེ་བཤད་པར་མཛོད།
en: Of the different bhūmis.

source: །འཁོར་འདི་ཤིན་ཏུ་རྣམ་དང་སྟེ།
en: “This assembly is perfectly pure,

source: །ལེ་ལོ་མེད་ཅིང་དགེ་དང་ལྡན།
en: Free of indolence, and splendid.

source: །དག་པའི་མཆོག་ལ་གནས་པ་སྟེ།
en: Its members reside in supreme purity.

source: །ཡོན་ཏན་ཡེ་ཤེས་ལྡན་པ་ཡི།
en: They possess qualities and wisdom.

source: །ཕན་ཚུན་གཅིག་ལ་གཅིག་ལྟ་ཞིང་།
en: “They are looking from one to the other

source: །ཀུན་ཀྱང་རིམ་གྲོ་བཅས་པར་གནས།
en: And are all waiting respectfully.

source: །སྦྲང་རྩི་ཇི་ལྟར་སྤང་མྱིན་པ།
en: They long for it like a bee for honey

source: །དེ་ལྟར་བདུད་རྩི་མཆོག་ཀྱང་འདོད།
en: And cannot give up this supreme amrita.

source: །རྡོ་རྗེའི་སྙིང་པོ་འཇིགས་མེད་པ།
en: “They heard you, Vajra­garbha,

source: །ཤེས་རབ་ཆེན་པོས་དེ་ཐོས་ནས། །འཁོར་རྣམས་དགའ་བར་བྱ་བའི་ཕྱིར།
en: Eloquent and greatly wise.

source: །བདེ་བར་གཤེགས་པའི་སྲས་ལ་སྨྲས།
en: Speak to the sons of the sugatas

source: །སངས་རྒྱས་སྐུར་བ་ཡང་དག་འབྱུང་བས་ན།
en: In order to delight the assembly. “This is the difficult, marvelous, perfect

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རབ་བསྟན་ཅིང་།
en: Teaching of bodhisattva conduct,

source: །ས་རྒྱུ་དམ་པ་རྣམ་པར་དབྱེ་བྱ་བ།
en: The supreme elucidation of the cause of the bhūmis

source: །དེ་ནི་རྨད་འབྱུང་མཆོག་ཏུ་དགའ་བ་ཡིན།
en: Through which the state of buddhahood is reached.

source: །ཕྲ་ཞིང་བལྟ་དཀའ་རྣམ་པར་རྟོག་པ་སྤངས།
en: “It is subtle, difficult to see, beyond thought,

source: །སེམས་ཀྱིས་དང་བྲལ་བས་བསྒྲུབ་པར་དཀའ།
en: Beyond the level of the mind, and difficult to accomplish.

source: །མཁས་པ་རྣམས་ཀྱི་ཟག་མེད་སྤྱོད་ཡུལ་ཏེ།
en: It is the undefiled domain of the wise,

source: །འགྲོ་བ་རྣམས་ཀྱིས་དེ་ཐོས་མོས་པར་འགྱུར།
en: And beings are bewildered when they hear of it.

source: །རྡོ་རྗེ་ལྟ་བུར་བསམ་པ་རབ་གཞག་སྟེ།
en: “When one has been established in the vajra-like essence,

source: །སངས་རྒྱས་ཡེ་ཤེས་མཆོག་ལ་མོས་བྱས་ཤིང་།
en: Has aspired to the supreme wisdom of buddhahood,

source: །བདག་མེད་པ་ཡི་སེམས་ཀྱིས་ཤེས་ན།
en: And has seen the absence of self in the level of the mind,

source: །ཡེ་ཤེས་དམ་པ་འདི་བཟོད་མཉན་པར་ནུས།
en: Then one is able to listen to this most subtle wisdom.

source: །ཇི་ལྟར་བར་སྣང་ཚོན་རིས་བྲིས་པ་དང་། །ནམ་མཁའི་དབྱིངས་ལ་རླུང་གནས་ཇི་བཞིན་དུ། །དེ་ལྟར་ཡེ་ཤེས་ཟག་པ་མེད་པ་ཡང་།
en: “Just like colors drawn in the sky, Just like the path of the wind through the air,

source: །ཤིན་ཏུ་བལྟ་དཀའ་ཐུབ་པས་རྣམ་པར་ཕྱེ། །དེ་ལ་བདག་གིས་སེམས་ནི་འདི་སྙམ་བྱེད།
en: It is difficult to see the different aspects

source: །སངས་རྒྱས་ཡེ་ཤེས་དམ་པ་བསམ་ཡས་ལ།
en: Of the immaculate wisdom of the bhagavats.

source: །འགྲོ་བ་གང་རྣམས་དད་པར་བྱེད་དཀོན་ཞེས།
en: “This is what I conclude:

source: །དེ་ཡི་ཕྱིར་ན་མ་སྨྲས་མ་བཤད་དོ།
en: You did not dare teach

source: །དེ་སྐད་སྨྲས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གྲོལ་བའི་ཟླ་བས།
en: That supreme wisdom Because beings would have no faith in it.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོ་ལ་འདི་སྐད་སྨྲས་སོ།
en: Then the bodhisattva Vimukti­candra spoke these words to the bodhisattva Vajra­garbha: “O jinaputra!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འཁོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་འདི་དག་ལ་བསམ་པ་ཤིན་ཏུ་སྦྱངས་པ། ཀུན་ཏུ་རྟོག་པ་ཡོངས་སུ་སྦྱངས་པ་སྤྱད་པར་བྱ་བ་ཤིན་ཏུ་སྤྱོད་པ། ཚོགས་ཤིན་ཏུ་བསྩགས་པ། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཤིན་ཏུ་བསྙེན་བཀུར་བ། ཡོན་ཏན་དང་ཡེ་ཤེས་ཚད་མེད་པ་དང་ལྡན་པ། ཐེ་ཙོམ་དང་ནེམ་ནུར་མེད་པ། ཉོན་མོངས་པ་དང་བྲལ་བ། མོས་པ་དང་ལྷག་པའི་བསམ་པ་ལ་རབ་ཏུ་གནས་པ། གཞན་གྱི་དྲིང་མི་འཇོག་པ་ཤ་སྟག་ཚོགས་པས་ཡོངས་སུ་དག་པ་ཡིན་གྱིས།
en: This is a very pure assembly of gathered bodhisattva mahāsattvas who (1) have very pure higher motivation, (2) have very pure thoughts, (3) have practiced excellent conduct, (4) have served excellently many trillions of buddhas, (5) have excellently gathered the accumulations, (6) possess limitless qualities and wisdom, (7) are free of doubt and uncertainty, (8) are free of blemish, (9) are resolute in their motivation and aspiration, and (10) are within the Dharma of the buddhas and do not rely on anything else.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱིས་ལེགས་པར་བཤད་པ་མཛོད་ཅིག་དང་། བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ཐམས་ཅད་ནི་རྣམ་པ་འདི་ལྟ་བུའི་གནས་ཟབ་མོ་ལ་མངོན་སུམ་དུ་གནས་པ་ཤ་སྟག་གོ །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གྲོལ་བའི་ཟླ་བས་དོན་འདི་ཉིད་གསལ་བར་བཟླས་པའི་ཕྱིར།
en: “O jinaputra, through the blessing of the tathāgatas teach well all these bodhisattvas who are present before you in this place.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The bodhisattva Vimukti­candra, in order to repeat his meaning clearly, recited these verses to the bodhisattva Vajra­garbha: “Teach the supreme Dharma of sublime peace, Which presents and differentiates the bhūmis

source: །བྱང་ཆུབ་སེམས་པས་སྤྱོད་པ་བླ་མེད་པ། །ས་རྣམས་རབ་ཕྱེ་རྣམ་དགོད་བརྟགས་པ་ཡི།
en: Of the unsurpassable conduct of the bodhisattva

source: །ཡེ་ཤེས་སྦྱོང་ཞིང་བྱང་ཆུབ་ཐོབ་བྱེད་པ། །མཆོག་དང་དམ་པ་ཞི་བའི་ཆོས་རྣམས་ཤོད།
en: That purifies wisdom and causes enlightenment.

source: །འཁོར་འདི་དག་པ་ཉོན་མོངས་མེད་པའི་མཆོག །མོས་དང་བསམ་པ་ཤིན་ཏུ་སྦྱངས་པ་སྟེ།
en: “Those in this assembly are supreme, free of the kleśas. With perfectly pure motivation and thought,

source: །སངས་རྒྱས་བྱེ་བ་མང་ལ་སྤྱད་པ་སྤྱད།
en: They have practiced with many trillions of buddhas

source: །ས་འདི་བརྟགས་ལ་ཡིད་ཆེས་ལྡན་པ་ཡིན།
en: And have examined and gained conviction in this bhūmi.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གྲོལ་བའི་ཟླ་བ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The bodhisattva Vajra­garbha said these words to the bodhisattva Vimukti­candra:

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འཁོར་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱི་རྣམ་པ་འདི་ལྟ་བུའི་གནས་ཟབ་མོ་ལ་བསམ་པ་ཤིན་ཏུ་སྦྱངས་པ། ཀུན་ཏུ་རྟོག་པ་ཡོངས་སུ་སྦྱངས་པ། སྤྱོད་པ་ཤིན་ཏུ་སྤྱད་པ། ཚོགས་ཤིན་ཏུ་བསྩགས་པ། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ལ་དགེ་བའི་རྩ་བ་ཤིན་ཏུ་བསྩགས་པ། ཡོན་ཏན་དང་ཡེ་ཤེས་ཚད་མེད་པ་དང་ལྡན་པ། ཐེ་ཙོམ་དང་ནེམ་ནུར་མེད་པ། ཉོན་མོངས་པ་དང་བྲལ་བ། མོས་པ་དང་ལྷག་པའི་བསམ་པ་ལ་རབ་ཏུ་གནས་པ། གཞན་གྱི་དྲིང་མི་འཇོག་པ་ཤ་སྟག་ཚོགས་པས་ཤིན་ཏུ་དག་པ་ཡང་ཡིན་ན།
en: “O jinaputra, this very pure assembly of gathered bodhisattva mahāsattvas (1) has very pure higher motivation, (2) has very pure thoughts, (3) has practiced excellent conduct, (4) has excellently served trillions of buddhas, (5) has excellently gathered the accumulations, (6) possesses limitless qualities and wisdom, (7) is free of doubt and uncertainty, (8) is free of blemish, (9) is resolute in its motivation and aspiration, and (10) is within the Dharma of the buddhas and does not rely on anything else.

source: འོན་ཀྱང་སེམས་ཅན་མོས་པ་ཆུང་ངུ་གཞན་དག་གིས་ཟབ་མོའི་རྣམ་པ་འདི་ལྟ་བུ་བསམ་གྱིས་མི་ཁྱབ་པའི་གནས་དག་ཐོས་པར་གྱུར་ལ་ཐོས་ནས་ཀྱང་ཐེ་ཙོམ་དང་ཡིད་གཉིས་སུ་གྱུར་ན། དེ་དག་ལ་ཡུན་རིང་པོར་གནོད་པ་དང་། དོན་མེད་པ་དང་། མི་བདེ་བའི་རྒྱུར་འགྱུར་བས་འདི་ལྟ་ཞིག་ཏུ་སྙིང་བརྩེ་བའི་ཕྱིར་བདག་ནི་ཅང་མི་ཟེར་བར་འདུག་པ་ཉིད་དུ་མོས་སོ།
en: “However, other beings with lesser aspiration will have doubts and uncertainty if they hear such inconceivable subjects as these, which for a long time will not bring them benefit but will harm them and cause them unhappiness. Therefore, I remained silent out of compassion for them.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་དོན་འདི་ཉིད་གསལ་བར་བསྟན་པའི་ཕྱིར་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Then Vajra­garbha recited these verses in order to make his meaning clear:

source: །འཁོར་འདི་རྣམ་དག་ཤེས་རབ་ཡངས་པ་སྟེ།
en: “Those in this assembly are pure; they have vast wisdom

source: །ཟབ་ཅིང་གསལ་བའི་སྤྱོད་ལྡན་རྟོག་ཤེས་ཤིང་།
en: And possess profound clear conduct and knowledge from examination.

source: །གཞན་དྲིང་མྱི་འཇོག་རི་རྒྱལ་བཞིན་མི་གཡོ།
en: They do not depend on anything else and are as unshakable as the king of mountains.

source: །བསམ་རྟོག་མི་འཁྲུག་རྒྱ་མཚོ་ཆེན་པོ་འདྲ།
en: Their thoughts are undisturbed and like a great ocean.

source: །འོན་ཀྱང་མ་རྟོགས་མི་ཤེས་མ་སྦྱང་བ།
en: “However, those who do not understand, do not know, and have not trained

source: །རྣམ་ཤེས་ཡུལ་ནས་དོན་ལ་ཤེས་མེད་པས།
en: Will not know this meaning when it is an object of their consciousness.

source: ཐོས་ཤིང་མ་ཆེས་ཕྲལ་དུ་ངན་སོང་ལྟུང་།
en: When they hear it they will disbelieve it and go immediately to the lower realms,

source: །དེ་དག་སྙིང་བརྩེས་ཡེ་ཤེས་ས་མ་བཤད།
en: So from compassion for them I did not teach the wisdom bhūmis.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གྲོལ་བའི་ཟླ་བས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོ་ལ་གསོལ་བ་བཏབ་པ།
en: Then the bodhisattva Vimukti­candra repeated this request to the bodhisattva Vajra­garbha:

source: ཀྱེ་རྒྱལ་བའི་སྲས་ལེགས་པར་བཤད་པ་མཛོད་ཅིག་དང་། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱིས་རྣམ་པ་འདི་ལྟ་བུ་བསམ་གྱིས་མྱི་ཁྱབ་པའི་གནས་འདི་དག་ཀྱང་གཞན་དུ་མི་འགྱུར་བ་དང་། ལེགས་པར་ཡིད་ཆེས་པར་འགྱུར་རོ།
en: “O jinaputra! Teach it well. Through the power of the tathāgatas these inconceivable subjects will be well protected and will be believed in.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དེ་ནི་འདི་ལྟར་ས་ཤིན་ཏུ་བསྟན་པ་འདི་བཤད་པའི་ཚེ་ཆོས་ཉིད་རབ་ཏུ་ཐོབ་པས། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་དགོངས་པར་འགྱུར། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱང་ཡེ་ཤེས་ཀྱིས་འདི་ཡོངས་སུ་བསྲུང་བའི་དོན་དུ་རབ་ཏུ་བརྩོན་པར་བྱེད་དོ།
en: When you give this teaching on the bhūmis to these jinaputras, there will be an understanding of the true nature, which is what all buddhas are intent upon, and all the bodhisattvas will long to protect this wisdom bhūmi.

source: །དེ་ཡང་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: འདི་ནི་སྤྱོད་པའི་ས་དང་པོ་སྟེ། འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་འགྲུབ་པའི་གཞི་ཡིན་ནོ།
en: Because this is both the initial conduct and complete attainment of the Buddhadharma.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན།
en: “O jinaputra!

source: ཡི་གེ་དང་འབྲུ་འགྲངས་པ་ཇི་སྙེད་དུ་བསྟན་པ་དེ་དག་ཐམས་ཅད་ཀྱི་སྔོན་དུ་འགྲོ་བའང་ཡི་གེའི་ཕྱི་མོའོ། །ཐ་མར་ཡང་ཡི་གེའི་ཕྱི་མོ་ལ་ཐུག་སྟེ། ཡི་གེའི་ཕྱི་མོ་བསྟན་པས་མ་ཁྱབ་པ་དེ་ལྟ་བུའི་ཡི་གེ་དང་འབྲུ་འགྲངས་པ་བསྟན་པ་ནི་གང་ཡང་མེད་དོ།
en: By analogy, the alphabet precedes the teaching of written letters and words. Without the alphabet being learned, written letters and words cannot be taught. “O jinaputra!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱང་སྤྱོད་པས་རབ་ཏུ་འགྲུབ་པས་ས་སྔོན་དུ་འགྲོ་བའོ། །རང་བྱུང་གི་ཡེ་ཤེས་ཀྱི་མཐར་ཐུག་པར་འགྱུར་བས། སའི་མཐར་ཐུག་པའོ་དེ་བས་ན།
en: In the same way, through the accomplishment of conduct the bhūmis precede all the qualities of buddhahood, and self-arisen wisdom is attained through the conclusion of the bhūmis.

source: ཀྱེ་རྒྱལ་བའི་སྲས་ཤོད་ཅིག་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱང་ཡོངས་སུ་བསྲུང་བའི་ཕྱིར་བྱིན་གྱིས་རློབ་པ་མཛད་དོ།
en: Therefore, O jinaputra, give your teaching! The tathāgata arhat samyak­sambuddhas will oversee its protection.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གྲོལ་བའི་ཟླ་བས་དོན་འདི་ཉིད་གསལ་བར་བཟླས་པའི་ཕྱིར། །བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། །ས་དང་སྤྱོད་འཇུག་བྱང་ཆུབ་འགྱུར་བ་ཡེ་ཤེས་སྒྲུབ་བྱེད་པ།
en: Then the bodhisattva Vimukti­candra, in order to repeat this clearly, recited these verses to the bodhisattva Vajra­garbha:

source: །སྤྱོད་པ་རྣམ་དག་ཐམས་ཅད་མཁྱེན་པའི་སྲས་ཀྱིས་ལེགས་པར་ཤོད།
en: “Son of the omniscient one! Teach well every pure conduct: The bhūmis, engagement in conduct, enlightenment, and the attainment of wisdom.

source: །ཕྱོགས་བཅུའི་རྒྱལ་བ་བདེ་གཤེགས་ཀུན་མགོན་འདྲེན་པ་ཇི་སྙེད་པ།
en: The jinas in the ten directions, all sugatas, every protector and guide—

source: །ཁྱུ་མཆོག་དེ་ཀུན་ཡེ་ཤེས་འབྱུང་གནས་སྟོན་ལ་དགོངས་པ་མཛད།
en: All those leaders are intent upon the teaching of the source of wisdom.

source: །འདི་ནི་དང་པོ་ཞུགས་པའི་ཤེས་སྤྱོད་འདི་མཐར་ཐུག་སྟེ།
en: “This initial wisdom and conduct is the ultimate conclusion.

source: །རྒྱལ་བའི་ཆོས་རབ་གཞལ་ཡས་ཇི་སྙེད་དེ་དག་འབྱུང་གནས་འདི།
en: It is the source of all the countless qualities of the jinas,

source: །ཡི་གེ་འགྲངས་པ་ཕྱི་མོའི་རྗེས་འགྲོ་སྔོན་དུ་དེ་འགྲོ་ལྟར།
en: Just as the alphabet precedes and accompanies letters and words.

source: །དེ་བཞིན་ས་མཆོག་བློ་ཡི་ཡུལ་དུ་ཐ་མ་ཐུག་པར་འདོང་།
en: We wish for the supreme bhūmis that are similarly the ultimate conclusion for the realm of the mind.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱི་དབྱངས་ཀྱི་ང་རོ་གཅིག་ཏུ་གླུའི་དབྱངས་ཀྱིས་ཚིགས་སུ་བཅད་དེ། བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོ་ལ་དོན་འདི་ཉིད་ཀྱི་ཕྱིར། གསོལ་བ་བཏབ་པ།
en: Then all the bodhisattvas sang together in one voice, making a request to the bodhisattva Vajra­garbha through the verses of a song:

source: བློ་ཡངས་དམ་པའི་ཕུལ་མངའ་བ།
en: “You have the supreme, highest understanding.

source: །སྤོབས་པ་མཐའ་ཡས་རྣམ་པར་དབྱེ་བ་རྟོགས་མཁྱེན་པས།
en: You are eloquent and possess infinite brilliance

source: །ཡིད་དུ་འོང་བའི་གསུང་དབྱངས་ཀྱིས།
en: Speak with your supreme beautiful voice,

source: །ཀུན་ལ་ཕན་དོན་དམ་པ་བཤད་པ་མཛོད།
en: That which possesses the ultimate truth.

source: །དྲན་དང་དགའ་བས་སྤྱོད་དག་པ།
en: “With pure understanding endowed with unwavering memory,

source: །སྟོབས་བཅུའི་སྟོབས་ཀྱིས་ཤུགས་སྩོགས་ཡོན་ཏན་ལྡན་པ་ཡི། །ས་ཡི་དམ་པ་མཆོག་གི་རྣམས།
en: Pure motivation, and the attainment of the strength of the ten strengths, And having analyzed the ten bhūmis with your own discrimination,

source: །ཐ་དད་ཡང་དག་དོན་མཁྱེན་སྤྱོད་པས་ཤོད།
en: Give the teaching of the supreme ten bhūmis.

source: །ཞི་སྡོམ་བསྒྲུབ་པའི་ཡིད་ལྡན་པ།
en: “They have good minds that are peaceful and restrained.

source: །ང་རྒྱལ་དྲེགས་དང་ལྟ་བའི་ཉོན་མོངས་ཞིར་གྱུར་པས།
en: They are free of arrogance, pride, and view-originated kleśas.

source: །འཁོར་འདིར་ཐེ་ཙོམ་བྲལ་བ་སྟེ།
en: Those of the assembly are free from doubt,

source: །ཁྱོད་ཀྱིས་ལེགས་པར་བཤད་དོ་རེ་ཞིག་སྡོད།
en: And they long to hear your teaching.

source: །སྐོམ་པ་བསིལ་བའི་ཆུ་འདོད་བཞིན།
en: “Just as the thirsty long for cool water,

source: །བཀྲེས་པ་ཁ་ཟས་ནད་པ་སྨན་རབ་འདོད་པ་དང་། བུང་བ་སྦྲང་རྩི་འདོད་པ་ལྟར།
en: The hungry want food, and the sick want medicine, And just as swarms of bees yearn for honey,

source: །དེ་བཞིན་འཁོར་འདི་ཁྱོད་ཀྱི་ཚིག་ལ་སྡོད།
en: In that way this assembly yearns for your words.

source: །དེ་བས་ཤིན་ཏུ་བློ་ཡངས་པས།
en: “You have excellent, stainless understanding.

source: །རྡུལ་མེད་རྣམས་ལས་ཡི་དམ་པ་འཇུག་པ་ཤོད།
en: Teach with clarity the different bhūmis, Describing completely the way of the sugatas,

source: །ཆགས་མེད་སྟོབས་བཅུའི་ཚོགས་གྱུར་པ།
en: Which is without impediment and possesses the ten strengths.”

source: །བདེ་གཤེགས་སྤྱོད་པ་མ་ལུས་བཤད་པར་མཛོད། །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་མཛོད་སྤུ་ནས། བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་སྣང་བ་ཞེས་བྱ་བའི་འོད་ཟེར་འཁོར་གྱི་འོད་ཟེར་བརྒྱ་སྟོང་གྲངས་མེད་པ་དང་ལྡན་པ་བྱུང་ངོ་།
en: Then at that time, there shone from the Bhagavat Śākyamuni’s ūrṇā hair a light ray called the light of bodhisattva power accompanied by a retinue of countless hundreds of thousands of light rays.

source: །དེ་བྱུང་ནས་ཕྱོགས་བཅུ་ཐམས་ཅད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་མ་ལུས་པར་སྣང་བར་བྱས་ནས། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ངན་སོང་གི་སྡུག་བསྔལ་ཐམས་ཅད་རྩེ་ཟིལ་བར་བྱས་ཏེ། བདུད་ཀྱི་ཁྱིམ་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ནས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་སྣང་བར་བྱས་ཏེ། སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་རྣམ་པ་བསམ་གྱིས་མྱི་ཁྱབ་པའི་མཐུ་བསྟན་ནས།
en: They illuminated all infinite worlds in the ten directions, ended the suffering of all beings in the lower existences, darkened all the palaces of the māras, illuminated the gathered assemblies of all tathāgatas, revealed the range of activity of the buddhas, illuminated the bodhisattvas who had been authorized with the authorization to teach in all the gathered assemblies of tathāgatas in every world throughout all the ten directions, revealed countless manifestations of buddhas, and then formed a network of clouds of light rays as vast kūṭāgāra halls situated in the sky.

source: ཕྱོགས་བཅུ་ཐམས་ཅད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་ཆོས་བསྟན་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་དུ་བརླབས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་སྣང་བར་བྱས་ཏེ། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ནས། སྟེང་གི་བར་སྣང་ལ་འོད་ཟེར་སྟུག་པོའི་སྤྲིན་གྱི་དྲ་བའི་ཁང་པ་བརྩེགས་པ་ཆེན་པོར་བྱས་ཏེ་འདུག་གོ །དེ་བཞིན་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་མཛོད་སྤུ་དག་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་འོད་སྣང་བ་ཞེས་བྱ་བའི་འོད་ཟེར་འཁོར་གྱི་འོད་ཟེར་གྲངས་མྱེད་པ་དང་ལྡན་པ་དག་བྱུང་བར་གྱུར་ཏོ། །བྱུང་ནས་ཀྱང་དེ་དག་གིས་ཕྱོགས་བཅུ་ཐམས་ཅད་དུ་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཀུན་ཏུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་ཆོས་བསྟན་པའི་བྱིན་གྱིས་བྱིན་དུ་བརླབས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྣང་བར་བྱས་ཏེ།
en: Then there shone from the ūrṇā hairs of the buddha bhagavats light rays called the light of bodhisattva power , which illuminated the bodhisattvas who had been authorized with the authorization to teach in all the gathered assemblies of tathāgatas in every world throughout all the ten directions;

source: སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མྱི་ཁྱབ་པ་བསྟན་ནས།
en: revealed countless manifestations of buddhas;

source: འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་ཡང་སྣང་བར་བྱས།
en: illuminated this Sahā universe;

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་འདིའང་སྣང་བར་བྱས་ཏེ།
en: illuminated the gathered assembly of this tathāgata, the Bhagavat Śākyamuni;

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་སྙིང་པོའི་ལུས་ཀྱང་སྣང་བར་བྱས་ནས།
en: illuminated the body and seat of the bodhisattva mahāsattva Vajra­garbha;

source: སྟེང་གི་བར་སྣང་ལ་དེ་བཞིན་དུ་འོད་ཟེར་སྟུག་པོའི་སྤྲིན་གྱི་དྲ་བའི་ཁང་པ་བརྩེགས་པ་ཆེན་པོར་བྱས་ཏེ་འཁོད་དོ།
en: and formed a network of clouds of light rays as a great kūṭāgāra hall situated in the sky.

source: །དེ་ནས་འོད་ཟེར་སྟུག་པོའི་སྤྲིན་གྱི་དྲ་བའི་ཁང་པ་བརྩེགས་པ་ཆེན་པོ་དེ་དག་ནས་སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་སྒྲའི་རྣམ་པ་འདི་ལྟ་བུ་འདི་བྱུང་ངོ་།
en: From that kūṭāgāra hall made of a network of clouds of light rays, there came these words through the power of the Buddha:

source: །མི་མཉམ་མཉམ་དང་མཉམ་པ་མཁའ་དང་མཉམ་པ་དག །སྟོབས་བཅུའི་ཁྱུ་མཆོག་མཐུ་ལྡན་ཚད་མེད་ཡོན་ཏན་ཅན།
en: “They who are equal to space, equal to the unequaled, The leaders who have the ten strengths, who have limitless qualities,

source: །འཇིག་རྟེན་ཀུན་མཆོག་མི་ཡི་དམ་པ་ཕུལ་གྱི་རྣམས།
en: They who are supreme among humans and deities,

source: ཤཱཀྱ་སེང་གེའི་ཆོས་ལ་བྱིན་རླབས་དམ་པ་མཛད།
en: Have given their blessing to the Dharma of the one born in the Śākya clan.

source: །བདེ་གཤེགས་སྲས་པོ་འདྲེན་པའི་བྱིན་གྱིས་བཤད་པར་གྱིས། །ཆོས་རྒྱལ་ཁྱུ་མཆོག་རྣམས་ཀྱི་མཛོད་ཀྱི་དམ་པ་ཕྱེ།
en: “With the authority of the sugatas, open the treasure of the Dharma kings,

source: །ས་ཡི་ཡེ་ཤེས་རྣམ་ཕྱེ་སྤྱོད་མཆོག་རབ་ཡངས་པ། །སྟོབས་བཅུའི་བྱིན་གྱིས་མ་ཐོགས་མྱུར་དུ་བསྟན་པ་གྱིས།
en: Which is the vast supreme conduct and the division of the wisdom bhūmis.

source: །གང་གི་རྣ་ལམ་བསམ་པར་ཆོས་དམ་རིན་ཆེན་འདི།
en: Those to whose ears comes this principal Dharma teaching

source: །སོང་བར་གྱུར་པ་དེ་དག་བདེ་གཤེགས་བྱིན་གྱིས་བརླབས།
en: Will be blessed by the sugatas and cared for by the bodhisattvas. “When they have completed

source: །རྡུལ་མེད་ས་ཀུན་རིམ་གྱིས་རབ་ཏུ་རྫོགས་བྱས་ནས།
en: The unblemished ten bhūmis,

source: །སྟོབས་བཅུ་ལྡན་པའི་རྒྱལ་བ་དམ་པར་འགྲུབ་པར་འགྱུར།
en: They will also attain the ten strengths And will attain buddhahood. “Those who are without doubt Will hear this Dharma teaching

source: །རྒྱ་མཚོའི་ཆུ་བྱུང་གྱུར་ཅིང་བསྐལ་པའི་མྱེས་གདུངས་ཀྱང་།
en: Even if they are sunk in the ocean Or thrown into the fire of the eon’s end.

source: །གལ་ཏེ་སྣོད་གྱུར་སེམས་ཅན་དེ་དག་འདི་ལ་ཉན།
en: “Those who remain in doubt

source: །གང་རྣམས་ཐེ་ཙོམ་ཟ་ཞིང་ཡིད་གཉིས་བྱེད་པ་ནི།
en: And those who become uncertain

source: །དེ་དག་རྣ་བས་རྣམ་པ་ཀུན་ཏུ་ཐོས་མི་འགྱུར།
en: Will never at any time Be able to attain hearing it.

source: །དེ་ཕྱིར་ས་ཡི་ཡེ་ཤེས་ལམ་མཆོག་བསྟན་པར་གྱིས།
en: “Therefore, teach well, according to their order,

source: །གནས་དང་རྒྱུད་དང་འཕྲོ་བ་རིམ་གྱིས་རབ་ཏུ་ཤོད།
en: The entry into, remaining in, and ascending

source: །སྤྱོད་དང་ཡུལ་དང་ཆོས་དང་ཡེ་ཤེས་ཚུལ་རྣམས་ཀྱི།
en: The supreme path of the wisdom bhūmis

source: །ཆོས་ཀྱི་ཚུལ་ཡང་འགྲོ་བ་ཀུན་ལ་ཕན་ཕྱིར་ཤོད།
en: Together with their range of conducts.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་ཕྱོགས་བཅུར་བལྟས་ནས། འཁོར་ཐམས་ཅད་དེ་བས་ཀྱང་དད་པར་བྱ་བའི་ཕྱིར་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Then the bodhisattva Vajra­garbha looked into the ten directions and spoke these verses so that the assembly would have faith:

source: །ཕྲ་ལ་ཤེས་དཀའ་དྲང་སྲོང་ཆེན་པོའི་ལམ།
en: “The path of the great sages is subtle, difficult to understand,

source: །མི་རྟོག་རྟོག་ཡུལ་མ་ཡིན་ལྟ་བར་དཀའ།
en: Inconceivable, beyond concepts, and difficult to reach.

source: །རང་བཞིན་ཞི་ཞིང་འགག་མེད་འབྱུང་བ་མེད། །མཁས་གསལ་ཤེས་པས་ཁོང་དུ་ཆུད་པ་ཡིན།
en: It is clearly known by those with expert knowledge. Its nature is peace; it is without cessation or origination.

source: །ངོ་བོ་ཉིད་སྟོང་ཞི་ཞིང་སྡུག་བསྔལ་ཟད།
en: “Its nature is empty, tranquil, nondual, and unending.

source: །རྒྱུད་ལས་རྣམ་གྲོལ་མཉམ་པར་མྱ་ངན་འདས།
en: It is liberation from existences, the attainment of equality.

source: །མཐའ་དང་དབུས་མེད་ཚིག་གིས་བརྗོད་དུ་མེད།
en: It has no middle or end; it cannot be described in words.

source: །དུས་གསུམ་གྲོལ་བ་ནམ་མཁའ་འདྲ་ཞིང་མཚུངས།
en: It is liberated from the three times and is the same as space.

source: །བདེ་གཤེགས་སྤྱོད་ཡུལ་ཞི་ཞིང་ཉེ་བར་ཞི།
en: “It is peace, extreme peace, and is known by the sugatas.

source: །སྨྲ་བའི་ལམ་རྣམས་ཀུན་གྱིས་བརྗོད་པར་དཀའ།
en: It is indescribable in any form of words.

source: །དེ་དག་ས་དང་སྤྱོད་པ་དེ་འདྲ་བས།
en: If the bhūmis and conducts are like this

source: །སྨྲ་བར་དཀའ་ན་བསྟན་པར་ག་ལ་ནུས།
en: And difficult to speak of, how can they be heard?

source: །དེ་ནི་བསམ་ཡས་སེམས་ལམ་རྣམ་པར་སྤངས།
en: “It is beyond thought, beyond the path of the mind.

source: །ཡེ་ཤེས་མངོན་བསྒྲུབས་རྒྱལ་བའི་སྤྱོད་ཡུལ་ཏེ།
en: It is the attainment of wisdom that is known by the lord of munis.
